Tekla.Structures.Model.PourBreak
The PourBreak class represents a pour break in a model.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
public void Example1()
{
Point startPointBeam = new Point(0.0, 0.0, 0.0);
Point endPointBeam = new Point(7200.0, 0.0, 0.0);
Beam beam = new Beam(startPointBeam, endPointBeam)
{
Profile = { ProfileString = "400*400" },
Material = { MaterialString = "Concrete_Undefined" }
};
if (beam.Insert())
{
Vector[] vertices = new[]
{
new Vector(2000.0,  200.0,    0.0),
new Vector(2000.0,  200.0, -400.0),
new Vector(2000.0, -200.0, -400.0),
new Vector(2000.0, -200.0,    0.0)
};
var outerWires = new int[1][];
outerWires[0] = new int[vertices.Length];
for (int i = 0; i < vertices.Length; i++)
outerWires[0][i] = i;
var innerWires = new Dictionary<int, int[][]> { };
var pourBreak = new PourBreak { Polymesh = new FacetedBrep(vertices, outerWires, innerWires) };
bool result = pourBreak.Insert();
}
}
}

Tekla.Structures.Model.PourBreak.Polymesh
Gets or sets the polymesh that forms the object geometry.

Tekla.Structures.Model.PourBreak.ModelObjectType
Gets the model object type for this instance.

Tekla.Structures.Model.PourBreak.Insert
Inserts a new model object. The geometry of the object
needs to be set by using the public Polymesh
function, before calling insert.
Returns: True on success.

Tekla.Structures.Model.PourBreak.Select
Selects the model object from the model by the identifier of this instance.
Returns: True on success.

Tekla.Structures.Model.PourBreak.Modify
Modifies the existing model object in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.PourBreak.Delete
Deletes the model object from the model database.
Returns: True on success.

Tekla.Structures.Model.PourBreak.ToStruct(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
converts this instance to a struct.
output:
The output parameter.

Tekla.Structures.Model.PourBreak.FromStruct(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Sets the properties of this instance from the struct.
input:
The input parameter.

Tekla.Structures.Model.PourBreak.CreateInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of creating this pour break in the model.
pourBreak: The pour break.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PourBreak.SelectInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of selecting this pour break in the model.
pourBreak: The pour break.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PourBreak.ModifyInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of modifying this pour break in the model.
pourBreak: The pour break.
Returns:
The error code returned from the delegate.